from aiogram import types, Router, F
from aiogram.filters import Command

router = Router()


@router.message(Command('help'))
async def send_help(message: types.Message):
    help_text = ("**Cписок команд для адмінстраторів**:\n"
                 "\t/ban - заблокувати користувача у цій групі.\n"
                 "\t/mute - обмежити користувача у правах надсилання повідомлень.\n"
                 "\t/unban - зняти блокування користувача у цій групі.\n"
                 "\t/unmute - зняти обмеження у користувача у правах надсилання повідомлень.\n"
                 "\t/warn - попередження(якщо користувач отримує 3 попередження, його заблокують).\n\n"

                 "Команду треба прописати, відповідаючи(reply) на повідомлення користувача, до якого ви "
                 "хочете застосувати відповідну дію\n"
                 "Вищезгадані команди також можна прописувати зі знаком ! замість / у початку!.\n\n"

                 "**Список команд для користувачів**:\n"
                 "\t/report - кинути скаргу на користувача за надіслане ним повідомлення.\n"
                 "\t/help   - переглянути список команд.\n"
                 "\t/description - переглянути опис бота.\n")

    await message.answer(help_text)
